Repository: 84000/data-translation-memory
Catalog: toh231-v1.tmx
Source language: bo
Languages: en

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ལམ་མཉམ་པ་ཡང་རབ་ཏུ་ཤེས། ལམ་ཉམ་ང་བའང་རབ་ཏུ་ཤེས། ལམ་བདེ་བའང་རབ་ཏུ་ཤེས། འཚམ་པའི་ལམ་ཡང་རབ་ཏུ་ཤེས། ལམ་ཆུ་ཆེ་བ་དང་། ཆུ་མེད་པ་ཡང་རབ་ཏུ་ཤེས། ལམ་གྱི་དགོངས་མལ་དག་ཀྱང་རབ་ཏུ་ཤེས། ལམ་གྱིས་ཚུགས་དག་ཀྱང་རབ་ཏུ་ཤེས། ལམ་འཁྱོག་པ་དག་ཀྱང་རབ་ཏུ་ཤེས། ལམ་དྲང་པོ་དག་ཀྱང་རབ་ཏུ་ཤེས། ལམ་འབྱུང་བ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: What are those ten? They are to know clearly which path is smooth, which path is fearsome, which is delightful, which is appropriate, which has water and which does not, where there are resting places to be found, which paths are well established, which paths are fast, which are direct, and where the paths begin.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ལམ་ལ་མཁས་པ་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas possessing these ten qualities are expert in the path.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ལམ་མ་ལོག་པར་སྟོན་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas possessing ten qualities are guides who unmistakenly point out the path.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཐེག་པ་ཆེན་པོས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ། བྱང་ཆུབ་སེམས་དཔའི་ལམ་སྟོན་གྱི་ཉན་ཐོས་ཀྱི་ལམ་མི་སྟོན་ཏོ།
en: What are those ten? They are as follows. To beings who are to be trained by means of the Great Vehicle they teach the path of the bodhisattvas, and not the path of the hearers.

source: ཉན་ཐོས་ཀྱིས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་ཉན་ཐོས་ཀྱི་ལམ་སྟོན་གྱི་བྱང་ཆུབ་སེམས་དཔའི་ལམ་མི་སྟོན་ཏོ།
en: To beings who are to be trained by means of the Hearers’ Vehicle they teach the path of the hearers, and not the bodhisattva path.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱིས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ལམ་སྟོན་གྱི། རང་སངས་རྒྱས་ཀྱི་ལམ་མི་སྟོན་ཏོ།
en: To beings who are to be trained through omniscience they teach the path of omniscience, and not the path of the solitary buddhas.

source: རང་སངས་རྒྱས་ཀྱིས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་རང་སངས་རྒྱས་ཀྱི་ལམ་སྟོན་གྱི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ལམ་མི་སྟོན་ཏོ།
en: To sentient beings who are to be trained by means of solitary buddhahood they teach the path of the solitary buddhas, and not the path of omniscience.

source: བདག་ཏུ་འཛིན་པ་ལ་མངོན་པར་ཞེན་པའི་སེམས་ཅན་རྣམས་དང་། ཆོས་སུ་འཛིན་པ་ལ་མངོན་པར་ཞེན་པ་རྣམས་ལ་བདག་མེད་པའི་ལམ་དང་། སྟོང་པ་ཉིད་ཀྱི་ལམ་སྟོན་གྱི།
en: To sentient beings who are attached to grasping at a self and grasping at phenomena they teach the path of no self and emptiness.

source: བདག་དང་སེམས་ཅན་དང་། སྲོག་དང་། གསོ་བ་དང་། སྐྱེས་བུ་དང་། གང་ཟག་གི་ལམ་མི་སྟོན་ཏོ།
en: They do not teach a path that is associated with a self, a sentient being, a life-force, a soul, a human being, or a person.

source: མཐའ་གཉིས་ལ་གནས་པའི་སེམས་ཅན་རྣམས་ལ་མཐའ་གཉིས་དང་བྲལ་བའི་ལམ་སྟོན་གྱི། མཐའ་གཉིས་ལ་གནས་པ་མི་སྟོན་ཏོ།
en: To sentient beings who are confined to the two extremes they teach a path that is free of those extremes. They do not teach a path confined to the two extremes.

source: སེམས་གཡེངས་པའི་སེམས་ཅན་རྣམས་ལ་ཞི་གནས་དང་། ལྷག་མཐོང་གི་ལམ་སྟོན་གྱི་གཡེང་བའི་ལམ་མི་སྟོན་ཏོ།
en: To distracted sentient beings they teach the path of tranquility and special insight, and not a path of distraction.

source: སྤྲོས་པ་ལ་མངོན་པར་དགའ་བའི་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་ཉིད་ཀྱི་ལམ་སྟོན་གྱི་བྱིས་པ་སྤྲོས་པ་ལ་མངོན་པར་དགའ་བའི་ལམ་མི་སྟོན་ཏོ།
en: To sentient beings who are obsessed with constructs they teach the path of suchness, and not a path of childish obsession with constructs.

source: འཁོར་བ་ལ་མངོན་པར་དགའ་བའི་སེམས་ཅན་རྣམས་ལ་མྱ་ངན་ལས་འདས་པའི་ལམ་སྟོན་གྱི་འཁོར་བའི་ལམ་མི་སྟོན་ཏོ།
en: To sentient beings fond of cyclic existence they teach the path of the transcendence of suffering, and not a path of cyclic existence.

source: ལམ་གོལ་བར་ཞུགས་པའི་སེམས་ཅན་རྣམས་ལ་ལམ་སྲོལ་མ་དོད་པ་མ་ཡིན་པ་དང་། ཚེར་མ་མེད་པའི་ལམ་སྟོན་གྱི་ཉོན་མོངས་པའི་ཚེར་མས་གང་བའི་ལམ་མི་སྟོན་ཏོ།
en: To sentient beings who have strayed from the path they teach the true path, a path free of thorns. They do not teach a path that is full of the thorns of affliction.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ལམ་མ་ལོག་པར་སྟོན་པ་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas possessing these ten qualities are guides who unmistakenly point out the path.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་སེམས་མཉམ་པར་གཞག་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas possessing ten qualities remain constantly in equipoise without any interruption.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ལུས་ལ་དྲན་པ་ཤིན་ཏུ་ཉེ་བར་གཞག་ཅིང་གནས་སོ། །ཚོར་བ་རྣམས་དང་། སེམས་དང་ཆོས་རྣམས་དང་། ཡུལ་རྣམས་དང་། དགོན་པ་རྣམས་དང་། གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། གཞོངས་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་རྣམས་དང་། རྙེད་པ་དང་། བཀུར་སྟི་དང་། གྲགས་པ་དང་། སྒྲ་དང་། ཚིགས་སུ་བཅད་པ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པས་བསླབ་པ་བཅས་པ་རྣམས་དང་། ཉེ་བའི་ཉོན་མོངས་པ་དང་། ཡོངས་སུ་ཉོན་མོངས་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་ལ་དྲན་པ་ཤིན་ཏུ་ཉེ་བར་གཞག་ཅིང་གནས་སོ།
en: What are those ten? They are to remain in the application of mindfulness with respect to the body; feelings; the mind; phenomena; objects; wilderness; villages, cities, towns, regions, districts, and royal courts; wealth, honor, fame, renown, and praise; the points of training taught by the thus-gone ones; and subsidiary afflictions, thorough afflictions, and complete afflictions.

source: རིགས་ཀྱི་བུ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ལུས་ལ་དྲན་པ་ཤིན་ཏུ་ཉེ་བར་གཞག་ཅིང་གནས་ཞེ་ན།
en: “You may wonder, noble son, how bodhisattvas remain in the application of mindfulness with respect to the body.

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་གང་ལུས་དང་ལྡན་པའི་སྡིག་པ་མི་དགེ་བའི་ཆོས་དེ་དག་ཡང་དག་པའི་ཤེས་རབ་ཀྱིས་རབ་ཏུ་བརྟགས་ཤིང་ཡོངས་སུ་སྤོང་ངོ་།
en: Noble son, through genuine insight bodhisattvas examine and abandon the unvirtuous and negative qualities that pertain to the body.

source: དེ་འོག་གི་རྐང་པའི་མཐིལ་ནས་བརྩམས་ཏེ། ཡར་ལ་ཀླད་པའི་བར་དུ་ལུས་ཀྱི་ཉེས་པ་ལ་རྟོག་གོ། །ལུས་ལ་བདག་མེད་པར་ཡང་རྟོག་གོ།
en: Beginning with the soles of their feet and proceeding all the way up to the brain, they contemplate the flaws of the body and recognize how the body is devoid of a self.

source: ལུས་མི་བརྟན་པ་དང་། འཇིག་པ་དང་། ཆུ་རྒྱུས་ཀྱིས་གླགས་པ་དང་། དྲི་མི་ཞིམ་པ་དང་། དྲི་ང་བ་དང་། ཁ་དོག་མི་སྡུག་པར་རྟོག་སྟེ།
en: They recognize that the body is fragile, perishable, held together by ligaments, foul smelling, stinking, and repulsive.

source: དེ་དེ་ལྟར་རྟོག་པའི་ཚེ། གང་ལུས་ལ་ལུས་སུ་འདོད་པ་དང་། ལུས་ལ་འདོད་ཆགས་པ་དང་། ལུས་ལ་དགའ་བ་དང་། ལུས་ལ་བདག་གིར་འཛིན་པ་དང་། ལུས་ལ་ཞེན་པ་དེ་དག་མི་འབྱུང་སྟེ།
en: This recognition puts an end to the notions of the body as being lasting, desirable, delightful, or something that can be owned, as well as to attachments that are based on the body.

source: དེའི་རྒྱུ་དེའི་རྐྱེན་དེའི་གཞིས་ལུས་དང་ལྡན་པའི་ཆོས་རྣམས་ཀྱི་དབང་དུ་འགྲོ་བར་མི་འགྱུར་ཏེ།
en: Through such causes, conditions, and bases they will no longer be controlled by those phenomena that make up a body.

source: གཞན་དུ་ན་ལུས་དང་ལྡན་པའི་ཆོས་རྣམས་དེ་ཉིད་ཀྱི་དབང་དུ་འགྱུར་ཏེ།
en: Instead, they will now control those phenomena that constitute a body.

source: དེ་ལྟར་ན་ལུས་ལ་དྲན་པ་ཤིན་ཏུ་ཉེ་བར་གཞག་ཅིང་གནས་པའོ།
en: Thus they remain in the application of mindfulness with respect to the body.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཚོར་བ་རྣམས་ལ་དྲན་པ་ཤིན་ཏུ་ཉེ་བར་གཞག་ཅིང་གནས་ཞེ་ན།
en: “You may wonder, noble son, how bodhisattvas remain in the application of mindfulness with respect to feelings.

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ། ཚོར་བ་གང་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ནི་སྡུག་བསྔལ་ན།
en: In this regard, bodhisattvas think as follows: ‘All feelings without exception are suffering.

source: བྱིས་པ་ཕྱིན་ཅི་ལོག་གིས་ཕྱིན་ཅི་ལོག་ཏུ་གྱུར་པ་རྣམས་ནི་བདེ་བར་འཛིན་ཏེ།
en: And yet, deceived by their own errors, childish beings believe that there are pleasant feelings.

source: བྱིས་པ་རྨོངས་པ་རྣམས་སྡུག་བསྔལ་ལ་བདེ་བ་ཞེས་བྱ་བར་འཛིན་གྱིས་འཕགས་པ་རྣམས་ཀྱིས་ནི་ཐམས་ཅད་སྡུག་བསྔལ་བར་ཐུགས་སུ་ཆུད་དོ་སྙམ་ནས་
en: While bewildered children refer to suffering as happiness, noble beings comprehend it as suffering.’

source: དེ་སྤང་བའི་ཕྱིར་ནན་ཏན་དུ་བྱེད་དོ།
en: Bodhisattvas thus endeavor to give up that misconception,

source: སེམས་ཅན་གཞན་དག་ཀྱང་བསླབ་པ་དེ་ཉིད་ལ་འགོད་ཀྱིས་བདག་གིས་ཀྱང་དེ་དག་གི་རྗེས་སུ་བསླབ་པར་བྱའོ་སྙམ་སྟེ།
en: while they also think: ‘I will establish other beings in the same training and personally train them myself.’

source: དེ་དེ་ལྟར་རྟོག་པས་ཚོར་བ་རྣམས་ལ་དྲན་པ་ཤིན་ཏུ་ཉེ་བར་གཞག་ཅིང་གནས་སོ།
en: Reflecting in this way bodhisattvas remain in the application of mindfulness with respect to feelings.

source: དེ་ཚོར་བ་དག་ལ་ཆགས་པའང་མེད། ཁོང་ཁྲོ་བའང་མེད་ཅིང་དེ་དག་སྤང་བའི་ཕྱིར་རབ་ཏུ་ཞུགས་པ་ཡིན་ནོ།
en: They develop neither desire for nor aversion to feelings but devote themselves to giving them up

source: གཞན་དག་ཀྱང་བསླབ་པ་དེ་ཉིད་ལ་འགོད་དེ།
en: while inspiring others to do the same.

source: དེ་ལྟར་ན་ཚོར་བ་རྣམས་ལ་དྲན་པ་ཤིན་ཏུ་ཉེ་བར་གཞག་ཅིང་གནས་སོ།
en: In this way they remain in the application of mindfulness with respect to feelings.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ལ་དྲན་པ་ཤིན་ཏུ་ཉེ་བར་གཞག་ཅིང་གནས་ཞེ་ན།
en: “You may wonder, noble son, how bodhisattvas remain in the application of mindfulness with respect to the mind.

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ། སེམས་འདི་ནི་མི་རྟག་པ་ལ་རྟག་པར་མངོན་པར་དགའ་བའོ།
en: Bodhisattvas think as follows: ‘The mind fondly believes that the impermanent is permanent.

source: སྡུག་བསྔལ་ལ་བདེ་བར་མངོན་པར་དགའ་བའོ།
en: It fondly believes that the painful is pleasant.

source: བདག་མེད་པ་ལ་བདག་ཏུ་མངོན་པར་དགའ་བའོ།
en: It fondly believes that the lack of self is a self.

source: མི་གཙང་བ་ལ་གཙང་བར་མངོན་པར་དགའ་བའོ།
en: It fondly believes that the unclean is pure.

source: གཡོ་ཞིང་མི་བརྟན་པ་ལ་མྱུར་དུ་འགྱུར་བའོ།
en: The mind moves, is unstable, and changes quickly.

source: ཉོན་མོངས་པ་རྣམས་ཀྱི་རྩ་བའོ།
en: It is the root of all affliction,

source: ངན་སོང་རྣམས་ཀྱི་སྒོའོ། །ཉེ་བའི་ཉོན་མོངས་པ་རྣམས་ཀྱི་གཞིའོ། །བདེ་འགྲོ་རྣམས་ཆུད་སོན་པའོ།
en: the gateway to the lower realms, the basis for all subsidiary afflictions, and it squanders the higher realms.

source: འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་རྣམས་ཀྱི་རྐྱེན་དུ་གྱུར་པའོ།
en: It is the condition for desire, anger, and dullness.

source: ཆོས་ཐམས་ཅད་ཀྱི་བདག་པོར་གྱུར་པའོ། །ཆོས་ཐམས་ཅད་ཀྱི་ཐོག་མར་སེམས་འགྲོ་སྟེ།
en: It is the owner of all phenomena. The mind precedes all phenomena,

source: སེམས་ཡོངས་སུ་ཤེས་ན་ཆོས་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་ཤེས་པར་འགྱུར་རོ།
en: so knowledge of the mind leads to knowledge of all phenomena.

source: གཞན་ཡང་འཇིག་རྟེན་སེམས་ཀྱིས་བྲིས་པ་སྟེ། སེམས་ནི་སེམས་ཀྱིས་མི་མཐོང་ངོ་།
en: The world is drawn by the mind, but the mind does not see itself.

source: དགེ་བའམ་ཡང་ན་མི་དགེ་བའི་ལས་ནི་སེམས་ཀྱིས་བསགས་པའོ།
en: It is the mind that accumulates virtuous or unvirtuous actions.

source: སེམས་ནི་མགལ་མེ་ལྟ་བུར་འཁོར། །སེམས་ནི་རྟ་ལྟར་འཁྱམ་པ་ཡིན། སེམས་ནི་ནགས་ཀྱི་མེ་ལྟར་འཚིག །སེམས་ནི་ཆུ་ཆེན་བཞིན་དུ་སྐྱེད།
en: The mind whirls like a firebrand, roams like a horse, consumes like a forest fire, and swells like a flood.’

source: དེ་དེ་ལྟར་རྟོག་པས་སེམས་ལ་དྲན་པ་ཤིན་ཏུ་ཉེ་བར་གཞག་ཅིང་གནས་ཏེ།
en: Thinking like this, they remain in the application of mindfulness with respect to the mind.

source: སེམས་ཀྱི་དབང་དུ་མི་འགྲོའི་སེམས་ཉིད་དེའི་དབང་དུ་འགྲོ་སྟེ།
en: they will not be controlled by the mind. Rather, the mind will come under their control.

source: སེམས་དེའི་དབང་དུ་གྱུར་པས་ཆོས་ཐམས་ཅད་དབང་དུ་གྱུར་པ་ཡིན་ཏེ།
en: With control of their own minds they gain control of all phenomena.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ལ་དྲན་པ་ཤིན་ཏུ་ཉེ་བར་གཞག་ཅིང་གནས་སོ།
en: Thus bodhisattvas remain in the application of mindfulness with respect to the mind.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་རྣམས་ལ་དྲན་པ་ཤིན་ཏུ་ཉེ་བར་གཞག་ཅིང་གནས་ཞེ་ན།
en: “You may wonder, noble son, how bodhisattvas remain in the application of mindfulness with respect to mental phenomena.

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདི་ལྟ་སྟེ། འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་ལ་སོགས་པ་དང་། དེ་དག་ལ་གནས་པ་གཞན་དག་ལ་འདི་དག་ནི་མི་དགེ་བའི་ཆོས་རྣམས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ།
en: As bodhisattvas correctly comprehend, ‘Desire, anger, dullness, and so on, along with their associated factors, are all unvirtuous.’

source: དེ་འདོད་ཆགས་ཀྱི་གཉེན་པོ་ལ་སྟེན། ཞེ་སྡང་དང་། གཏི་མུག་གི་གཉེན་པོ་ལ་སྟེན་ཅིང་དེ་དག་སྤང་བའི་ཕྱིར་བརྩོན་པ་ཡིན་ནོ།
en: So they endeavor in the application of the remedies to desire, anger, and dullness so that they may all come to an end.

source: ཆོས་འདི་དག་ནི་དགེ་བའོ་ཞེས་བྱ་བར་ཤེས་ནས་ཆོས་དེ་དག་ལ་སེམས་གཏོང་ཞིང་དྲན་པ་ཉེ་བར་གཞོག་སྟེ།
en: Understanding that the factors involved in this process are virtuous, they direct their minds toward those factors and apply mindfulness to them,

source: ཆོས་དེ་དག་ཀྱང་ཡང་དག་པར་བླངས་ཤིང་གནས་སོ།
en: adopting and assimilating them correctly.

source: གཞན་ཡང་བསླབ་པ་དེ་ཉིད་ལ་འགོད་དེ།
en: Moreover, they also establish others in the same training.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་རྣམས་ལ་དྲན་པ་ཤིན་ཏུ་ཉེ་བར་གཞག་ཅིང་གནས་སོ།
en: Thus, bodhisattvas remain in the application of mindfulness with respect to phenomena.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཡུལ་རྣམས་ལ་དྲན་པ་ཤིན་ཏུ་ཉེ་བར་གཞག་ཅིང་གནས་ཞེ་ན།
en: “You may wonder, noble son, how bodhisattvas remain in the application of mindfulness with respect to objects.

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཡིད་དུ་འོང་བ་དང་། ཡིད་དུ་མི་འོང་བའི་གཟུགས་དང་། སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་བྱ་ལ་ཆགས་པར་འཛིན་པར་ཡང་མི་འགྱུར།
en: Bodhisattvas develop neither attached grasping nor aggressive thoughts in relation to pleasant or unpleasant forms, sounds, smells, tastes, or textures.

source: ཁོང་ཁྲོ་བའི་སེམས་ཀྱང་མི་སྐྱེད་དེ། དེ་འདི་སྙམ་དུ་སེམས་ཏེ། དེ་ལྟར་བདག་དངོས་པོ་མེད་པའི་ཆོས་རྣམས་ལ་ཆགས་པ་སྐྱེད་པ་ནི་བདག་གི་མི་ཆ་སྟེ།
en: Instead they think, ‘Developing desire in relation to such insubstantial phenomena would be unbecoming for me.

source: དེ་ནི་བདག་བྱིས་པ་དང་། རྨོངས་པ་དང་། མི་གསལ་བ་དང་། མི་མཁས་པར་འགྱུར་རོ།
en: It would be childish, dull, and bereft of clarity and skill.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་ཆགས་པར་གྱུར་ནས་ཞེན་པར་འགྱུར་རོ། །ཞེན་ནས་རྨོངས་པར་འགྱུར་རོ།
en: The Blessed One has taught, “With desire comes attachment, and from attachment follows dullness.

source: རྨོངས་ནས་དགེ་བའམ། མི་དགེ་བའི་ཆོས་རྣམ་པར་བསྒོམ་པར་མི་འགྱུར་ཏེ། དེའི་རྒྱུས་ངན་སོང་དུ་འགྲོ་བར་གསུངས་སོ་ཞེས་དེ
en: With dullness one fails to practice in relation to virtuous or unvirtuous qualities, and as a result one will take rebirth in the lower realms.”

source: འདི་སྙམ་དུ་དེ་ལྟར་བདག་ཆོས་གསོག་རྣམས་ལ་ཁོང་ཁྲོ་བའི་སེམས་སྐྱེད་པ་ནི་བདག་གི་མི་ཆ་སྟེ།
en: With that in mind it would also not be right for me to develop any aversion to mental objects and the like.

source: དེ་ནི་བདག་གི་མི་བཟོད་པ་དང་། དང་དུ་མི་ལེན་པ་དང་། ཁྲོ་བ་ཀུན་ནས་ལྡང་བར་འགྱུར་ཏེ།
en: If, failing to be patient and accepting, I should instead become aggressive toward anyone,

source: འཕགས་པ་རྣམས་ཀྱིས་ནི་སྨད་པར་འགྱུར། ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་རྣམས་ཀྱིས་ནི་དཔྱ་བར་འགྱུར་རོ་ཞེས་དེ་
en: I would be scorned by noble beings and derided by those who observe pure conduct.’

source: དེ་ལྟར་རྟོག་པས་ཡུལ་རྣམས་ལ་དྲན་པ་ཤིན་དུ་ཉེ་བར་གཞག་ཅིང་གནས་ཏེ། ཡུལ་རྣམས་ཀྱིས་མི་སྨས་ཤིང་རྨ་བྱུང་བར་མི་འགྱུར་ལ།
en: Thinking like this, they remain in the application of mindfulness with respect to objects and they are, therefore, neither hurt nor harmed by objects.

source: གཞན་ཡང་བསླབ་པ་བཅས་པ་དེ་ཉིད་ལ་འགོད་དེ།
en: Moreover, they also establish others in the same training.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཡུལ་རྣམས་ལ་དྲན་པ་ཤིན་ཏུ་ཉེ་བར་གཞག་ཅིང་གནས་སོ།
en: Thus, bodhisattvas remain in the application of mindfulness with respect to objects.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དགོན་པ་རྣམས་ལ་དྲན་པ་ཤིན་ཏུ་ཉེ་བར་གཞག་ཅིང་གནས་ཞེ་ན།
en: “You may wonder, noble son, how bodhisattvas remain in the application of mindfulness with respect to the wilderness.

source: དེ་འདི་སྙམ་དུ་དགོན་པ་ཞེས་བྱ་བ་འདི་ནི་ཉོན་མོངས་པ་མེད་པར་རྣམ་པར་སྤྱོད་པ་རྣམས་ཀྱི་གནས་སོ།
en: They think as follows: ‘The wilderness refers to the residence of those who experience freedom from affliction,

source: ཞི་བར་རྣམ་པར་སྤྱོད་པ་རྣམས་ཀྱི་གནས་སོ།
en: the dwelling place of those who experience peace.

source: དགོན་པ་ལ་ནི་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་གཞན་གྱི་སེམས་མངོན་པར་ཤེས་པ་དག་ཀྱང་ཡོད་དེ།
en: Moreover, in the wilderness there will be gods, nāgas, yakṣas, and gandharvas endowed with the kind of superknowledge that knows the minds of others.

source: དེ་དག་བདག་གི་སེམས་དང་། སེམས་ལས་བྱུང་བའི་ཆོས་རྣམས་རབ་ཏུ་ཤེས་ན། བདག་ཚུལ་བཞིན་མ་ཡིན་པའི་ཡིད་ལ་བྱེད་ཅིང་སེམས་པ་དེ་ནི་བདག་གི་མི་ཆའོ་སྙམ་སྟེ།
en: Such beings will, therefore, be aware of the constitution of my own mind and mental states, so giving rise to any improper thoughts or attitudes would not be becoming for me.’

source: དེ་ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱ་བ་ཐམས་ཅད་དང་བྲལ་ནས་ཚུལ་བཞིན་དུ་ཆོས་རྣམས་ལ་སེམས་གཏོང་ཞིང་ཆོས་དེ་དག་ལ་སྒོམ་པ་མང་བ་ཡིན་ཏེ།
en: Thus, free of all incorrect mental activity, they properly direct their minds to the Dharma teachings and train in them abundantly.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དགོན་པ་རྣམས་ལ་དྲན་པ་ཤིན་ཏུ་ཉེ་བར་གཞག་ཅིང་གནས་སོ།
en: Thus bodhisattvas remain in the application of mindfulness with respect to the wilderness.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། གཞོངས་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་རྣམས་ལ་དྲན་པ་ཤིན་ཏུ་ཉེ་བར་གཞག་ཅིང་གནས་ཞེ་ན།
en: “You may wonder, noble son, how bodhisattvas remain in the application of mindfulness with respect to villages, cities, towns, regions, districts, and royal courts.

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། གཞོངས་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་དག་ན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་
en: When engaged in their activities within villages, cities, towns, regions, districts, or royal courts, bodhisattvas

source: གནས་གང་ཚུལ་དང་མི་འདྲ་ཞིང་ཡོངས་སུ་སྤང་བར་བྱ་བ་རབ་ཏུ་བྱུང་བའི་ཚུལ་དང་མི་འཐུན་པ་དེ་དག་ཡོངས་སུ་སྤོང་ངོ་།
en: will not remain in any location that is inappropriate, to be abandoned, or in disharmony with the way of ordained practitioners.

source: དེ་དག་ཀྱང་གང་ཞེ་ན། འདི་ལྟ་སྟེ་ཆང་མའི་ཁྱིམ་འམ། སྨད་འཚོང་གི་ཁྱིམ་འམ། རྒྱལ་པོའི་ཕོ་བྲང་ངམ། བརྒྱན་པོའི་གནས་སམ། ར་རོ་བའི་འཁོར་གྱི་ཚོགས་སམ། གར་མཁན་དང་། གླུ་གར་གྱི་གནས་དང་། དེ་མ་ཡིན་པ་གཞན་ཡང་རུང་སྟེ།
en: What are such locations? They are taverns, brothels, royal palaces, festival sites, bars, places of dance and singing, or any other such place.

source: རབ་ཏུ་བྱུང་བའི་ཚུལ་དང་མི་འདྲ་བ་དེ་དག་ཡོངས་སུ་སྤང་ཞིང་། དེ་དག་ལ་དྲན་པ་ཤིན་ཏུ་ཉེ་བར་གཞག་ཅིང་གནས་ཏེ།
en: Giving up all such places that are in discord with the way of ordained practitioners entirely, they remain in the application of mindfulness with respect to such places.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། གཞོངས་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་དག་ལ་དྲན་པ་ཤིན་ཏུ་ཉེ་བར་གཞག་ཅིང་གནས་སོ།
en: Thus bodhisattvas remain in the application of mindfulness with respect to villages, cities, towns, regions, districts, and royal courts.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྙེད་པ་དང་། བཀུར་སྟི་དང་། གྲགས་པ་དང་། སྒྲ་དང་། ཚིགས་སུ་བཅད་པ་དག་ལ་དྲན་པ་ཤིན་ཏུ་ཉེ་བར་གཞག་ཅིང་གནས་ཞེ་ན།
en: “You may wonder, noble son, how bodhisattvas remain in the application of mindfulness with respect to wealth, honor, fame, renown, and praise.

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སྦྱིན་པ་བྱེད་པ་རྣམས་ཀྱི་བསོད་ནམས་ཀྱི་དངོས་པོ་ཉེ་བར་བཟུང་ཞིང་། རྙེད་པ་དང་། བཀུར་སྟི་ལ་སེམས་གཏོང་སྟེ།
en: Bodhisattvas embrace the meritorious nature in the practice of generosity. They disengage from the pursuit of wealth and honor,

source: ཅི་ནས་ཀྱང་ཞེན་པར་མི་འགྱུར། སྲེད་པ་མི་སྐྱེད། ཆགས་པ་མི་སྐྱེད།
en: and do everything in their power to prevent attachment, craving, and desire.

source: བདག་གིར་མི་བྱེད། ནོར་དུ་མི་འཛིན། བདག་གིར་མི་འཛིན་པ་དང་།
en: They do not take possession of anything and they do not think in terms of wealth and ownership.

source: ཅི་ནས་ཀྱང་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཤིང་
en: They act out of solidarity with all beings in all that they do.

source: སྡུག་བསྔལ་བའི་སེམས་ཅན་རྣམས་ལ་ཕན་པར་འགྱུར་བ་དེ་ལྟར་གཏོང་སྟེ།
en: To those who suffer they offer all that is needed.

source: གལ་ཏེ་ཡང་དེའི་རྒྱུ་དེའི་རྐྱེན་དེའི་གཞིས་གྲགས་པ་དང་། སྒྲ་དང་། ཚིགས་སུ་བཅད་པ་ཞིག་བྱུང་ཡང་དེས་ཁེངས་པར་མི་འགྱུར། ང་རྒྱལ་མི་སྐྱེ། རྒྱགས་པ་མི་སྐྱེ་སྟེ།
en: If they become famous due to such causes, conditions, and bases, or if others praise or glorify them, bodhisattvas do not become bloated, proud, or conceited.

source: དེ་འདི་སྙམ་དུ་སེམས་སོ།
en: Instead they will think,

source: རིང་པོར་མི་ཐོགས་པར་གྲགས་པ་དང་། སྒྲ་དང་། ཚིགས་སུ་བཅད་པ་འདི་དག་གང་ལས་བྱུང་བ་དང་། གང་གིས་ཕྱུང་བ་དང་། གྲགས་པ་དང་། སྒྲ་དང་། ཚིགས་སུ་བཅད་པ་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་དུ་ཐམས་ཅད་མེད་པར་འགྱུར་ན།
en: ‘Before long the grounds and sources of this fame, praise, and glory will have vanished, and so will the fame, praise, and glory itself.

source: དེ་ལ་མཁས་པའི་རང་བཞིན་ཅན་སུ་ཞིག་མི་རྟག་ཅིང་མི་གནས་པའི་ཆོས་མི་བརྟན་པ།
en: What wise person could become fond of phenomena that are so impermanent, unstable, unreliable, and fickle?

source: ཡིད་བརྟན་དུ་མི་རུང་བ་དག་ལ་དགའ་བའི་སེམས་སྐྱེས་པའམ། ཁེངས་པར་འགྱུར་བའམ། ང་རྒྱལ་དང་། རྒྱགས་པས་དྲེགས་པར་འགྱུར་སྙམ་སྟེ།
en: How could a wise person become arrogant, proud, or conceited based on such phenomena?’

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྙེད་པ་དང་། བཀུར་སྟི་དང་། གྲགས་པ་དང་། སྒྲ་དང་། ཚིགས་སུ་བཅད་པ་རྣམས་ལ་དྲན་པ་ཤིན་ཏུ་ཉེ་བར་གཞག་ཅིང་གནས་སོ།
en: Thus, bodhisattvas remain in the application of mindfulness with respect to wealth, honor, fame, praise, and glory.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པས་བསླབ་པ་བཅས་པ་ལ་དྲན་པ་ཤིན་ཏུ་ཉེ་བར་གཞག་ཅིང་གནས་ཞེ་ན།
en: “You may wonder, noble son, how bodhisattvas remain in the application of mindfulness with respect to the points of training taught by the thus-gone ones.

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ། གང་འདས་པའི་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཀྱང་བསླབ་པ་འདི་ཉིད་ལ་བསླབས་ཏེ། མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ།
en: Bodhisattvas think as follows: ‘It was by adhering to exactly this training that the thus-gone ones of the past gained complete awakening and went entirely beyond suffering.

source: གང་མ་བྱོན་པ་འབྱུང་བར་འགྱུར་བ་དེ་དག་ཀྱང་བསླབ་པ་འདི་ཉིད་ལ་བསླབས་ཤིང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་རོ།
en: Future thus-gone ones, who have not yet arrived, will also attain complete awakening and go entirely beyond suffering through this very training.

source: གང་ད་ལྟར་གྱི་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཀྱང་བསླབ་པ་འདི་ཉིད་ལ་བསླབས་ཏེ། མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །ཡོངས་སུ་མྱ་ངན་ལས་འདའོ་ཞེས་
en: And also the thus-gone ones of the present have gained their complete awakening and gone completely beyond suffering by means of precisely this training.’

source: དེ་དེ་ལྟར་ཡིད་ཆེས་པས་བསླབ་པ་རྣམས་ལ་ནན་ཏན་དུ་བྱེད་པ་ཡིན་ཏེ། བརྩོན་པར་བྱེད་པ་དང་།
en: With such confidence, bodhisattvas pursue their training diligently and persistently.

source: ལེགས་པར་བྱ་བ་བྱེད་ཅིང་ཤིན་ཏུ་རྫོགས་པར་བྱེད་པ་ཡིན་ཏེ།
en: Doing what is needed, they perfect their training.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པས་བསླབ་པ་བཅས་པ་ལ་དྲན་པ་ཤིན་ཏུ་ཉེ་བར་གཞག་ཅིང་གནས་སོ།
en: Thus bodhisattvas remain in the application of mindfulness with respect to the points of training taught by the thus-gone ones.

source: རིགས་ཀྱི་བུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཉེ་བའི་ཉོན་མོངས་པ་དང་། ཡོངས་སུ་ཉོན་མོངས་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་ལ་དྲན་པ་ཤིན་ཏུ་ཉེ་བར་གཞག་ཅིང་གནས་ཞེ་ན།
en: “You may wonder, noble son, how bodhisattvas remain in the application of mindfulness with respect to subsidiary afflictions, thorough afflictions, and complete afflictions.

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཉེ་བའི་ཉོན་མོངས་པ་རྣམས་ལ་དྲན་པ་དང་ལྡན་པ་ཡིན། ཡོངས་སུ་ཉོན་མོངས་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་རྣམས་ལ་དྲན་པ་དང་ལྡན་པ་ཡིན་ཏེ།
en: Endowed with mindfulness concerning subsidiary afflictions, thorough afflictions, and complete afflictions,

source: དེ་དག་གང་ལས་བྱུང་བ་དང་། རྐྱེན་གང་གིས་བྱུང་བའི་གཞི་ཡང་རབ་ཏུ་ཤེས་ཏེ།
en: bodhisattvas fully understand where such afflictions come from and what the conditions that serve as their basis are.

source: དེས་དེ་ལྟར་ཤེས་ནས་འབྱུང་བ་དེ་དང་། རྐྱེན་དེ་དག་ཡོངས་སུ་སྤོང་སྟེ།
en: With that knowledge, they give up such origination and conditioning.
